{"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2024/12/03/hello-world/"},{"title":"Example Post","text":"This is a post for the “Blog” menu.","link":"/2024/12/03/example/"},{"title":"Simulation for digital holograms on tilted planes","text":"Link to Optica Article is the spectrum of the object at . We then rotate the wave vector coordinates , where . Consider 3D rotation matrix (clockwise rotation): We can get the rotated wave vector components: Substituting into the expression: Therefore, Before applying the inverse Fourier transform, the grids have to be mapped into a uniformly spaced frequency grid using interpolation methods. Finally,","link":"/2024/12/03/planes/"}],"tags":[{"name":"Example","slug":"Example","link":"/tags/Example/"},{"name":"optics","slug":"optics","link":"/tags/optics/"},{"name":"numerical simulation","slug":"numerical-simulation","link":"/tags/numerical-simulation/"}],"categories":[{"name":"Life","slug":"Life","link":"/categories/Life/"},{"name":"Projects","slug":"Projects","link":"/categories/Projects/"},{"name":"Blog","slug":"Blog","link":"/categories/Blog/"}],"pages":[{"title":"Curriculum Vitae","text":"Download EducationUniversity of California, Los Angeles (September, 2021 - Now)I’m currently pursuing my Ph.D. degree under the supervision of Professor Aydogan Ozcan. My research primarily focuses on computational imaging and optical neural networks. Zhejiang University (September, 2017 - June, 2021)I received a BE degree in Optical Science and Engineering with a Honors Degrees from Chu Kochen Honors College of Zhejiang University. There I did researches in optical super resolution imaging such as STimulated Emission Depletion microscopy (STED) and SAturated Competition microscopy (SAC). Ningbo Xiaoshi High School (September, 2014 - June, 2021)I graduated from Ningbo Xiaoshi High School, a prestigious school located in Ningbo, Zhejiang Province, China. Established in 1912, the school has fostered the growth of nearly 20 members of the Chinese Academy of Sciences and Engineering throughout its rich history. Tu Youyou, the first Chinese Nobel Prize laureate in Physiology or Medicine, also graduate from here. Publications Bai, B.+, Li, Y.+, Luo, Y.+, Li, X., Çetintaş, E., Jarrahi, M. and Ozcan, A., 2023. All-optical image classification through unknown random diffusers using a single-pixel diffractive network. Light: Science &amp; Applications, 12(1), p.69. Bai, B., Luo, Y., Gan, T., Hu, J., Li, Y., Zhao, Y., Mengu, D., Jarrahi, M. and Ozcan, A., 2022. To image, or not to image: class-specific diffractive cameras with all-optical erasure of undesired objects. eLight, 2(1), pp.1-20. Li, Y.+, Luo, Y.+, Bai, B. and Ozcan, A., 2022. Analysis of Diffractive Neural Networks for Seeing Through Random Diffusers. IEEE Journal of Selected Topics in Quantum Electronics, 29(2: Optical Computing), pp.1-17. Li, C., Li, Y., Han, Y., Zhang, Z., Li, Y., Wang, W., Hao, X., Kuang, C. and Liu, X., 2020. Pulsed saturated absorption competition microscopy on nonbleaching nanoparticles. Acs Photonics, 7(7), pp.1788-1798. Li, Y., Li, C., Li, Y., Hao, X., Kuang, C. and Liu, X., 2020. 3D resolution enhancement in saturated competition microscopy. Applied Optics, 59(34), pp.10661-10666. +: Co-author Conferences B. Bai, Y. Li*, Y. Luo, X. Li, E. Cetintas, M. Jarrahi and A. Ozcan, 2023, February. Object classification through unknown random diffusers using a single-pixel diffractive network and spectrum encoding. In SPIE Photonics West, AI and Optical Data Sciences IV. Y. Li*, Y. Luo, B. Bai and A. Ozcan, 2023, February, Diffractive imagers see through random unknown diffusers. In SPIE Photonics West, AI and Optical Data Sciences IV. Li, Y.*, Luo, Y., Bai, B. and Ozcan, A., 2022, October. Diffractive optical imagers can see through random unknown diffusers. In Frontiers in Optics (pp. FM5E-3). Optica Publishing Group. Li, C.*, Li, Y., Kuang, C. and Liu, X., 2019, November. Fluorescence optical super-resolution imaging of nitrogen-vacancy centers based on saturated competition microscopy. In Advanced Optical Imaging Technologies II (Vol. 11186, p. 1118603). SPIE. *: Presenter AwardsUniversity of California, Los Angeles (September 2019 - Now)I was awarded the Department Fellowship to pursue my Ph.D. degree at UCLA. Zhejiang University (September 2017 - June 2021)I was awarded the First-Class Scholarship for Outstanding Merits of Zhejiang University, and Guoguang First-Class Scholarship for three years. I was awarded National Second-Level athlete in table tennis","link":"/curriculum/index.html"},{"title":"Publications","text":"","link":"/Publications/index.html"},{"title":"Projects","text":"","link":"/projects/index.html"},{"title":"","text":"Simulation for digital holograms on tilted planeshttps://opg.optica.org/oe/fulltext.cfm?uri=oe-13-24-9935&id=86288 $$\\hat{O}(d;u,v) = O(u,v)exp[i2\\pi d (\\lambda ^{-2}-u^2-v^2)]$$ $$u=\\xi/\\lambda d, v=\\eta/\\lambda d$$ $O(u,v) = F{o(x,y)}$ is the spectrum of the object at $z=0$. We then rotate the wave vector coordinates $k=2\\pi[u,v,w],w=(\\lambda ^{-2}-u^2-v^2)^{1/2}$. Consider 3D rotation matrix (clockwise rotation): we can get rotated wave vector components $k=2\\pi[\\hat{u},\\hat{v},\\hat{w}],\\hat{u}=u\\cos\\theta -w\\sin \\theta, \\hat{v} =v,\\hat{w}=u\\sin\\theta+w\\cos\\theta$. $$u = \\hat{u}\\cos\\theta + \\hat{w}\\sin\\theta$$ Therefore, $\\hat{O}(d;\\hat{u},\\hat{v})=\\hat{O}(d;\\hat{u}\\cos\\theta+\\hat w\\sin\\theta,\\hat{v})$ Before application of the inverse Fourier transform, the grids have to be mapped into a uniformly spaced frequency grid using interpolation methods. Finally, $o(\\hat{x},\\hat{y}) = F^{-1}\\hat{O}(d;\\hat{u}\\cos\\theta+\\hat w\\sin\\theta,\\hat{v})$","link":"/assets/numerical%20simulation/Simulation%20for%20digital%20holograms%20on%20tilted%20planes%2064ad91102a0e4d58b1af0ea339ce9d85.html"},{"title":"Yuhang Li","text":"Hi! My name is Yuhang Li (李煜航). I am currently a Ph.D. student at UCLA’s Bio- and Nano-photonics Lab, working under the supervision of Professor Aydogan Ozcan. I earned my Bachelor of Engineering (BEng) degree in June 2021 from Zhejiang University, China. My current research focuses on computational imaging and optical neural networks. News Sept, 2024 - Emil Wolf Outstanding Student Paper Competition at FiO+LS 2024 Mar, 2024 - Advanced to candidacy for the doctoral degree Feb, 2024 - Three oral presentations at SPIE PW 2024 Aug, 2023 - Best early career researcher presentation, Silver at SPIE Optics + Photonics 2023 Sept, 2021 - Joined UCLA Bio- and Nano-photonics Lab Jul, 2021 - Graduated from Zhejiang University with the bachelor of engineering Selected PublicationsFull publications list here","link":"/index.html"}]}